app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "articles"."id" = ?  [["image_file_size", 8428], ["image_updated_at", 2016-08-08 18:58:21 UTC], ["updated_at", 2016-08-08 18:58:21 UTC], ["image_file_name", "myNameIsBady.jpg"], ["id", 2]]