app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("email", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", ""], ["username", "example"], ["created_at", 2016-08-09 20:26:49 UTC], ["updated_at", 2016-08-09 20:26:49 UTC]]